turbinesFoam/tests/rotationalAugmentation/rotor/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 -0.8 -0.8) // 0
    ( 1.0 -0.8 -0.8) // 1
    ( 1.0  0.8 -0.8) // 2
    (-0.5  0.8 -0.8) // 3
    (-0.5 -0.8  0.8) // 4
    ( 1.0 -0.8  0.8) // 5
    ( 1.0  0.8  0.8) // 6
    (-0.5  0.8  0.8) // 7
);

blocks
(
    // 15 x 16 x 16 uniform cells of 0.1 m (cubic): h = cbrt(V) = 0.1. The
    // half-width 0.8 m leaves the cosine support (2.5 h) of the outermost
    // plate node (radius <= 0.4 m) clear of the lateral boundaries.
    hex (0 1 2 3 4 5 6 7) (15 16 16) simpleGrading (1 1 1)
);

edges
();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
