turbinesFoam/tests/rotationalAugmentation/rotor/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Minimal one-blade axial-flow rotor for the rotational-augmentation tests.
// Two elements at r = 0.15 m and r = 0.35 m of a 0.45 m rotor, chord 0.04 m,
// zero twist, TSR 3 (so Lambda ~= 0.949). The default dictionary carries NO
// `rotationalAugmentation` block: this is the default-off baseline used by the
// byte-identical gate. `fvOptions.on` adds the block (active on, DuSelig,
// a=b=d=1); `fvOptions.asm` is the same block with the no-mesh actuator
// surface element; `fvOptions.on-fast` raises the TSR to move the operating
// point below stall.

turbine
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             turbine;
        origin              (0 0 0);
        axis                (1 0 0);
        verticalDirection   (0 0 1);
        freeStreamVelocity  (10 0 0);
        tipSpeedRatio       3.0;
        rotorRadius         0.45;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          off;
            endEffectsModel Glauert;
        }

        blades
        {
            blade1
            {
                writePerf           true;
                writeElementPerf    true;
                elementType         actuatorLineElement;
                nElements           2;
                elementProfiles     (S809 S809);
                elementData
                (
                    (0.0  0.05  0.0  0.04  0.25  0.0)
                    (0.0  0.45  0.0  0.04  0.25  0.0)
                );
            }
        }

        profileData
        {
            S809
            {
                // No `Re` key: the static polar is the raw committed table, so
                // the pure-Python reference can reproduce it exactly.
                data (#include "S809.dat");
            }
        }
    }
}

// ************************************************************************* //
