turbinesFoam/tests/rotationalAugmentation/rotor/system/fvOptions.nogeom
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Edge case: the augmentation block is active but no radial geometry reaches
// the element. The block sits in the blade subdict (not the turbine coeffs), so
// the rotor does not forward `rotorRadius`/`rootRadius`; the element must warn
// and skip the correction instead of aborting, and the static polar must be
// unchanged. This pins the spec scenario "Absent keys keep the old dictionary
// valid".

turbine
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             turbine;
        origin              (0 0 0);
        axis                (1 0 0);
        verticalDirection   (0 0 1);
        freeStreamVelocity  (10 0 0);
        tipSpeedRatio       3.0;
        rotorRadius         0.45;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          off;
            endEffectsModel Glauert;
        }

        blades
        {
            blade1
            {
                writePerf           true;
                writeElementPerf    true;
                elementType         actuatorLineElement;
                nElements           2;
                elementProfiles     (S809 S809);
                elementData
                (
                    (0.0  0.05  0.0  0.04  0.25  0.0)
                    (0.0  0.45  0.0  0.04  0.25  0.0)
                );

                rotationalAugmentation
                {
                    active          on;
                    model           DuSelig;
                    a               1;
                    b               1;
                    d               1;
                }
            }
        }

        profileData
        {
            S809
            {
                data (#include "S809.dat");
            }
        }
    }
}

// ************************************************************************* //
